In [1]:
import numpy as np
import pandas as pd

### 26. Series

In [2]:
labels = ['a','b','c'] # a list
my_data = [10,20,30]
arr = np.array(my_data) # a numpy array
d={'a':10,'b':20,'c':30} # a dictionary

In [3]:
arr

array([10, 20, 30])

In [4]:
my_data

[10, 20, 30]

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

There are 3 ways to create a Series:
+ Pass an list (my_data)
+ Pass a Numpy array (arr)
+ Pass a dictionary(d)

we can assign the index values by ourselves:

In [7]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
# we can pass a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [12]:
# we can pass a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

Remember, the 1st parameter is data while the second one is the index:

In [13]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
# Grabbing a value works like a dictionary
ser1['USA']

1

In [18]:
ser3 = pd.Series(data=labels)

In [19]:
ser3

0    a
1    b
2    c
dtype: object

In [21]:

ser1 + ser2
#Integers will be convered into float numbers automatically

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### 27. Data Frames Part 1

DataFrame is going to be the main tool.

In [23]:
from numpy.random import randn
np.random.seed(101) # We will get the same random numbers

In [24]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

DataFramde is a bunch of Series sharing the same index.

In [26]:
df
# A bunch of Series sharing index. W is a Series, X is a Series..

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Two ways to get a column:
+ df[column name]
+ df.column name 
The 1st is recommended.

In [27]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
# The result is a Series
type(df['W'])

pandas.core.series.Series

In [29]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [31]:
df['new'] = df['W']+ df['Y']

#### To remove something-> drop
+ 'axis' needs to be specified: 0 means index while 1 means column
+ 'inplace' needs to be true if we  want to change it in place.

In [34]:
# To remove
df.drop('new',axis =1, inplace =True) # axis needs to be one to represent the column rather than index!!

In [35]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df.shape

(5, 4)

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
# columns
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

#### To get a row:
+ Method 1: df.loc[label based index]
+ Method 2: df.iloc[numberical based index]

In [41]:
# rows
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [42]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

#### Select subset

In [44]:
df.loc['B','Y']

-0.8480769834036315

In [46]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### DataFrames Part 2

#### Conditional Selection

In [47]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
booldf= df >0

In [50]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [51]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:

df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [54]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [58]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

### Multiple conditions

In [59]:
df[df['W'] >0 and df['Y'] > 1]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

Error will occur: Because df['W'] will result in a Series of boolean value and df['Y'] > 1, too. And 'and' operation cannot work on two Series, it only works on two single logical value.

Instead, **'&'** should be used!!

In [61]:
df[(df['W'] >0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

#### Reset index

In [62]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

The 'index' will be reset to a column.

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Use a column as the new index

In [65]:
newind = 'CA NY WY OR CO'.split()

In [66]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df['States'] = newind

In [68]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [69]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### 29. DataFrames Part 3

#### Multi-indexed data

In [73]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [78]:
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [79]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [80]:
inside

[1, 2, 3, 1, 2, 3]

In [81]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [83]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [84]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [85]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [87]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [88]:
df.index.names

FrozenList([None, None])

In [89]:
df.index.names = ['Groups','Num']

In [90]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

####

In [91]:
df.loc['G2'].loc[2,'B']

0.19679950499134005

#### Cross Section

In [ ]:
df.xs

In [92]:
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [93]:
df.loc['G1']

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [95]:
df.xs(1,level = 'Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

### 30.Missing Data

How to deal with missing data?

+ Drop missing data : df.dropna(axis, thresh)
+ Fill out missing data: df.fillna(value)

In [96]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [97]:
df = pd.DataFrame(d)

In [98]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [99]:
## Drop missing value

In [100]:
df.dropna() # This will drop the whole row

     A    B  C
0  1.0  5.0  1

In [102]:
df.dropna(axis =1)

   C
0  1
1  2
2  3

In [105]:
df.dropna(thresh=2) # Kept all the rows which have at least 2 non-nan points

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [106]:
## Fill nan

In [107]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [110]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [111]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### 31.Groupby

In [112]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah']
        ,'Sales':[200,120,340,124,243,350]}

In [113]:
df = pd.DataFrame(data)

In [114]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [117]:
byComp = df.groupby('Company')

In [119]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [120]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [121]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [122]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [123]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0